[
    {
        "id": 1,
        "category": "g",
        "name": "iPhone 6 Plus",
        "imageSrc": "http://cdn2.gsmarena.com/vv/pics/apple/apple-iphone-6-plus-1.jpg",
        "price": "$209ish",
        "interestScore": 9,
        "description": "Ok, summary cause this is kinda long:<br><br> <ul><li>I want a new phone</li><li>I'm eligible to upgrade right now for around $200 plus tax and other things</li><li>I want an iPhone 6 Plus (I'm ok with you giving me a hard time about this)</li><li>It's gonna be tough to get and still surprise me</li></ul><br><br>I had the option to upgrade phones and switch carriers back in June, and I took full advantage of it by switching to Verizon and getting a Windows Phone. I'm gonna be honest, I've actually liked it way more than I thought I would, but unfortunately it's really worn thin on me over the past month or so. The app selection is pitiful (no Google anything, no Imgur, etc.), and I've just gotten rather bored with it. <br><br> When I signed up with Verizon, I got an Edge contract that lets me upgrade early if I pay off 60% of my current phone. That just so happens to be a reasonable dollar amount, so I've decided that this is probably the one thing that I want most of all this year. I'm not exactly sure which phone I want, and as you can see, an iPhone is actually at the top of my list. A high-end Android phone would likely also be desirable, although I really don't want a Galaxy.<br><br>The tough thing about this is that there's really no way to make this a surprise. The phone and plan are under my name only, so to go through with this, I'd basically have to get my own present for myself. I'm not necessarily opposed to that, however, I'm just saying it might feel a bit lame. I'm sure there might be a way around it, such as just having me give permission to activate my new phone on Christmas Day, and not telling me exactly which phone it is that I'm getting. I don't really know. Regardless, this is still probably what I want the most this year, so I'm willing to make something work."
    },
    {
        "id": 2,
        "category": "g",
        "name": "Xbox One",
        "imageSrc": "http://compass.xbox.com/assets/94/60/946002c9-dfc7-44fe-b20a-abf175c49d42.jpg?n=og-share-meet-xbox-one-955x955.jpg",
        "price": "$349.99",
        "interestScore": 8,
        "description": "I've talked about the fact that I want an Xbox One for a while now, and I definitely do still want one. However, there are a lot of other things I also want, and a $350 item is kind of pushing people's budgets a bit. I'm not saying that I don't want an Xbox, just that I'm not sure if it's worth the money."
    },
    {
        "id": 3,
        "category": "g",
        "name": "Fitbit Charge",
        "imageSrc": "https://static1.fitbit.com/simple.b-cssdisabled-png.h1b5eeed389c93a00f375564cdec89e54.pack?items=%2Fcontent%2Fassets%2Fcharge%2Fimages%2Fslide-01-charge.png",
        "price": "$129.95",
        "interestScore": 9,
        "description": "Ok, so I'd actually really love to have a Fitbit. Zachy needs to start getting in shape, and gadgets always make the process slightly more fun and enjoyable for me. It doesn't necessarily have to be the Fitbit Charge, so long as it's not that dorky looking pedometer. Gross."
    },
    {
        "id": 4,
        "category": "g",
        "name": "Fitbit Aria",
        "imageSrc": "http://g-ecx.images-amazon.com/images/G/01/hpc/detail-page/c26-B0077L8YOO-1-l.jpg",
        "price": "$129.95",
        "interestScore": 6,
        "description": "As you can see, the Fitbit Aria is a scale that connects wirelessly with your Fitbit wristband. It allows you to add extra data to your analysis, such as your weight, BPI, and more over a period of time, along with the standard things that your wristband tracks. It's not a must-have, and obviously I wouldn't want the scale without the wristband, but it would be really nice to have alongside the normal Fitbit."
    },
    {
        "id": 5,
        "category": "g",
        "name": "Apple Magic Mouse",
        "imageSrc": "http://store.storeimages.cdn-apple.com/4205/as-images.apple.com/is/image/AppleInc/aos/published/images/M/B8/MB829/MB829?wid=800&hei=800&fmt=jpeg&qlt=95&op_sharpen=0&resMode=bicub&op_usm=0.5,0.5,0,0&iccEmbed=0&layer=comp&.v=1400690353435",
        "price": "$69.00",
        "interestScore": 5,
        "description": "All of these Apple items are things that I'd like to accompany my Macbook Pro. In this case, a wireless mouse (specifically this Apple-branded one, since it supports OS X gestures)."
    },
    {
        "id": 6,
        "category": "g",
        "name": "Apple USB SuperDrive",
        "imageSrc": "http://store.storeimages.cdn-apple.com/4205/as-images.apple.com/is/image/AppleInc/aos/published/images/M/D5/MD564/MD564?wid=800&hei=800&fmt=jpeg&qlt=80&op_sharpen=0&resMode=bicub&op_usm=0.5,0.5,0,0&iccEmbed=0&layer=comp&.v=1400693447662",
        "price": "$79.00",
        "interestScore": 5,
        "description": "All of these Apple items are things that I'd like to accompany my Macbook Pro. In this case, an external CD/DVD drive, since Macbooks don't have them built in anymore."
    },
    {
        "id": 7,
        "category": "g",
        "name": "HP Officejet 4630 e-All-in-One Printer",
        "imageSrc": "http://store.storeimages.cdn-apple.com/4205/as-images.apple.com/is/image/AppleInc/aos/published/images/H/GM/HGM82/HGM82?wid=800&hei=800&fmt=jpeg&qlt=95&op_sharpen=0&resMode=bicub&op_usm=0.5,0.5,0,0&iccEmbed=0&layer=comp&.v=1410570037226",
        "price": "$99.95",
        "interestScore": 4,
        "description": "All of these Apple items are things that I'd like to accompany my Macbook Pro. In this case, an all-in-one printer to replace the really crappy one that we currently have. I picked this one out because it's officially supported by Apple, which means it has the capability to print from your phone and Mac without plugging in, but I don't need this specific printer if you can find a cheaper one with comparable specs."
    },
    {
        "id": 8,
        "category": "g",
        "name": "Cooler Master JAS PRO Foldable Aluminum Stand for MacBook Pro",
        "imageSrc": "http://store.storeimages.cdn-apple.com/4205/as-images.apple.com/is/image/AppleInc/aos/published/images/H/A0/HA009/HA009?wid=800&hei=800&fmt=jpeg&qlt=95&op_sharpen=0&resMode=bicub&op_usm=0.5,0.5,0,0&iccEmbed=0&layer=comp&.v=1400796631644",
        "price": "$69.95",
        "interestScore": 5,
        "description": "All of these Apple items are things that I'd like to accompany my Macbook Pro. In this case, a stand for my laptop to allow it to cool itself off. As much as I love my Macbook and how compact and light it is, one of the downsides is that it has a really hard time letting heat out and gets really hot on my lap."
    },
    {
        "id": 9,
        "category": "g",
        "name": "Sennheiser Momentum Over-Ear Headphones",
        "imageSrc": "http://en-us.sennheiser.com/content-box-images/1251/momentum_over_ear_1.jpg",
        "price": "$229.95",
        "interestScore": 6,
        "description": "This is another one of those things that I actually really do want, but I know it's a bit too expensive to be practical. My current over-ear headphones are kinda breaking, so I'm looking for a replacement. I'm a bit picky with headphones though, which is why I understand that this probably isn't the most practical gift."
    },
    {
        "id": 10,
        "category": "g",
        "name": "Moto 360",
        "imageSrc": "http://cdn-www.xda-developers.com/wp-content/uploads/2014/09/moto-360-smartwatch-580-90.jpg",
        "price": "$249.99",
        "interestScore": 3,
        "description": "I'm gonna be honest, the only reason this is even on my list is just because it's cool as heck. I mean, don't let its looks fool you - it's actually a digital smartwatch that connects to your phone and shows notifications and whatnot. However, it only works with Android phones, and it's $250, making it the least practical item on my list."
    }
]
